STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp235dxx_cm33.h
/***************  Bit definition for DTS_TS0SDIFDONER register  ***************/
#define DTS_TS0SDIFDONER_SDIF_SMPL_DONE_Pos         (0U)
#define DTS_TS0SDIFDONER_SDIF_SMPL_DONE_Msk         (0x1UL << DTS_TS0SDIFDONER_SDIF_SMPL_DONE_Pos)        /*!< 0x00000001 */
#define DTS_TS0SDIFDONER_SDIF_SMPL_DONE             DTS_TS0SDIFDONER_SDIF_SMPL_DONE_Msk                  /*!< Sample done flag  */

/***************  Bit definition for DTS_TS0SDIFDATAR register  ***************/
#define DTS_TS0SDIFDATAR_SAMPLE_DATA_Pos            (0U)
#define DTS_TS0SDIFDATAR_SAMPLE_DATA_Msk            (0xFFFFUL << DTS_TS0SDIFDATAR_SAMPLE_DATA_Pos)        /*!< 0x0000FFFF */
#define DTS_TS0SDIFDATAR_SAMPLE_DATA                DTS_TS0SDIFDATAR_SAMPLE_DATA_Msk                     /*!< Sample data */
#define DTS_TS0SDIFDATAR_SAMPLE_TYPE_Pos            (16U)
#define DTS_TS0SDIFDATAR_SAMPLE_TYPE_Msk            (0x1UL << DTS_TS0SDIFDATAR_SAMPLE_TYPE_Pos)           /*!< 0x00010000 */
#define DTS_TS0SDIFDATAR_SAMPLE_TYPE                DTS_TS0SDIFDATAR_SAMPLE_TYPE_Msk                     /*!< TS sample type */
#define DTS_TS0SDIFDATAR_SAMPLE_FAULT_Pos           (17U)
#define DTS_TS0SDIFDATAR_SAMPLE_FAULT_Msk           (0x1UL << DTS_TS0SDIFDATAR_SAMPLE_FAULT_Pos)          /*!< 0x00020000 */
#define DTS_TS0SDIFDATAR_SAMPLE_FAULT               DTS_TS0SDIFDATAR_SAMPLE_FAULT_Msk                    /*!< Sample fault */

/**************  Bit definition for DTS_TS0ALARMA_CFGR register  **************/
#define DTS_TS0ALARMA_CFGR_HYSTA_THRESH_Pos         (0U)
#define DTS_TS0ALARMA_CFGR_HYSTA_THRESH_Msk         (0xFFFFUL << DTS_TS0ALARMA_CFGR_HYSTA_THRESH_Pos)     /*!< 0x0000FFFF */
#define DTS_TS0ALARMA_CFGR_HYSTA_THRESH             DTS_TS0ALARMA_CFGR_HYSTA_THRESH_Msk                  /*!< Alarm A hysteresis threshold */
#define DTS_TS0ALARMA_CFGR_ALARMA_THRESH_Pos        (16U)
#define DTS_TS0ALARMA_CFGR_ALARMA_THRESH_Msk        (0xFFFFUL << DTS_TS0ALARMA_CFGR_ALARMA_THRESH_Pos)    /*!< 0xFFFF0000 */
#define DTS_TS0ALARMA_CFGR_ALARMA_THRESH            DTS_TS0ALARMA_CFGR_ALARMA_THRESH_Msk                 /*!< Alarm A threshold */

/***************  Bit definition for DTS_TS0HLSAMPLER register  ***************/
#define DTS_TS0HLSAMPLER_SMPL_LO_Pos                (0U)
#define DTS_TS0HLSAMPLER_SMPL_LO_Msk                (0xFFFFUL << DTS_TS0HLSAMPLER_SMPL_LO_Pos)            /*!< 0x0000FFFF */
#define DTS_TS0HLSAMPLER_SMPL_LO                    DTS_TS0HLSAMPLER_SMPL_LO_Msk                         /*!< Lowest valid data sample value received */
#define DTS_TS0HLSAMPLER_SMPL_HI_Pos                (16U)
#define DTS_TS0HLSAMPLER_SMPL_HI_Msk                (0xFFFFUL << DTS_TS0HLSAMPLER_SMPL_HI_Pos)            /*!< 0xFFFF0000 */
#define DTS_TS0HLSAMPLER_SMPL_HI                    DTS_TS0HLSAMPLER_SMPL_HI_Msk                         /*!< Highest valid data sample value received */

/**************  Bit definition for DTS_TS0HILORESETR register  ***************/
#define DTS_TS0HILORESETR_SMPL_LO_SET_Pos           (0U)
#define DTS_TS0HILORESETR_SMPL_LO_SET_Msk           (0x1UL << DTS_TS0HILORESETR_SMPL_LO_SET_Pos)          /*!< 0x00000001 */
#define DTS_TS0HILORESETR_SMPL_LO_SET               DTS_TS0HILORESETR_SMPL_LO_SET_Msk                    /*!< Sample Low Set */
#define DTS_TS0HILORESETR_SMPL_HI_CLR_Pos           (1U)
#define DTS_TS0HILORESETR_SMPL_HI_CLR_Msk           (0x1UL << DTS_TS0HILORESETR_SMPL_HI_CLR_Pos)          /*!< 0x00000002 */
#define DTS_TS0HILORESETR_SMPL_HI_CLR               DTS_TS0HILORESETR_SMPL_HI_CLR_Msk                    /*!< Sample high clear 0 */

/*****************  Bit definition for DTS_TS1_IER register  ******************/
#define DTS_TS1_IER_IRQ_EN_FAULT_Pos                (0U)
#define DTS_TS1_IER_IRQ_EN_FAULT_Msk                (0x1UL << DTS_TS1_IER_IRQ_EN_FAULT_Pos)               /*!< 0x00000001 */
#define DTS_TS1_IER_IRQ_EN_FAULT                    DTS_TS1_IER_IRQ_EN_FAULT_Msk                         /*!< Fault IRQ enable bit */
#define DTS_TS1_IER_IRQ_EN_DONE_Pos                 (1U)
#define DTS_TS1_IER_IRQ_EN_DONE_Msk                 (0x1UL << DTS_TS1_IER_IRQ_EN_DONE_Pos)                /*!< 0x00000002 */
#define DTS_TS1_IER_IRQ_EN_DONE                     DTS_TS1_IER_IRQ_EN_DONE_Msk                          /*!< Sample done IRQ enable bit */
#define DTS_TS1_IER_IRQ_EN_ALARMA_Pos               (3U)
#define DTS_TS1_IER_IRQ_EN_ALARMA_Msk               (0x1UL << DTS_TS1_IER_IRQ_EN_ALARMA_Pos)              /*!< 0x00000008 */
#define DTS_TS1_IER_IRQ_EN_ALARMA                   DTS_TS1_IER_IRQ_EN_ALARMA_Msk                        /*!< Alarm A IRQ enable bit */
#define DTS_TS1_IER_IRQ_EN_ALARMB_Pos               (4U)
#define DTS_TS1_IER_IRQ_EN_ALARMB_Msk               (0x1UL << DTS_TS1_IER_IRQ_EN_ALARMB_Pos)              /*!< 0x00000010 */
#define DTS_TS1_IER_IRQ_EN_ALARMB                   DTS_TS1_IER_IRQ_EN_ALARMB_Msk                        /*!< Alarm B IRQ enable bit */

/*****************  Bit definition for DTS_TS1_ISR register  ******************/
#define DTS_TS1_ISR_IRQ_STATUS_FAULT_Pos            (0U)
#define DTS_TS1_ISR_IRQ_STATUS_FAULT_Msk            (0x1UL << DTS_TS1_ISR_IRQ_STATUS_FAULT_Pos)           /*!< 0x00000001 */
#define DTS_TS1_ISR_IRQ_STATUS_FAULT                DTS_TS1_ISR_IRQ_STATUS_FAULT_Msk                     /*!< Fault IRQ status bit */
#define DTS_TS1_ISR_IRQ_STATUS_DONE_Pos             (1U)
#define DTS_TS1_ISR_IRQ_STATUS_DONE_Msk             (0x1UL << DTS_TS1_ISR_IRQ_STATUS_DONE_Pos)            /*!< 0x00000002 */
#define DTS_TS1_ISR_IRQ_STATUS_DONE                 DTS_TS1_ISR_IRQ_STATUS_DONE_Msk                      /*!< Sample done IRQ status bit */
#define DTS_TS1_ISR_IRQ_STATUS_ALARMA_Pos           (3U)
#define DTS_TS1_ISR_IRQ_STATUS_ALARMA_Msk           (0x1UL << DTS_TS1_ISR_IRQ_STATUS_ALARMA_Pos)          /*!< 0x00000008 */
#define DTS_TS1_ISR_IRQ_STATUS_ALARMA               DTS_TS1_ISR_IRQ_STATUS_ALARMA_Msk                    /*!< Alarm A IRQ status bit */
#define DTS_TS1_ISR_IRQ_STATUS_ALARMB_Pos           (4U)
#define DTS_TS1_ISR_IRQ_STATUS_ALARMB_Msk           (0x1UL << DTS_TS1_ISR_IRQ_STATUS_ALARMB_Pos)          /*!< 0x00000010 */
#define DTS_TS1_ISR_IRQ_STATUS_ALARMB               DTS_TS1_ISR_IRQ_STATUS_ALARMB_Msk                    /*!< Alarm B IRQ status bit */

/*****************  Bit definition for DTS_TS1_ICR register  ******************/
#define DTS_TS1_ICR_IRQ_CLEAR_FAULT_Pos             (0U)
#define DTS_TS1_ICR_IRQ_CLEAR_FAULT_Msk             (0x1UL << DTS_TS1_ICR_IRQ_CLEAR_FAULT_Pos)            /*!< 0x00000001 */
#define DTS_TS1_ICR_IRQ_CLEAR_FAULT                 DTS_TS1_ICR_IRQ_CLEAR_FAULT_Msk                      /*!< Fault IRQ clear bit */
#define DTS_TS1_ICR_IRQ_CLEAR_DONE_Pos              (1U)
#define DTS_TS1_ICR_IRQ_CLEAR_DONE_Msk              (0x1UL << DTS_TS1_ICR_IRQ_CLEAR_DONE_Pos)             /*!< 0x00000002 */
#define DTS_TS1_ICR_IRQ_CLEAR_DONE                  DTS_TS1_ICR_IRQ_CLEAR_DONE_Msk                       /*!< Sample done IRQ clear bit */
#define DTS_TS1_ICR_IRQ_CLEAR_ALARMA_Pos            (3U)
#define DTS_TS1_ICR_IRQ_CLEAR_ALARMA_Msk            (0x1UL << DTS_TS1_ICR_IRQ_CLEAR_ALARMA_Pos)           /*!< 0x00000008 */
#define DTS_TS1_ICR_IRQ_CLEAR_ALARMA                DTS_TS1_ICR_IRQ_CLEAR_ALARMA_Msk                     /*!< Alarm A IRQ clear bit */
#define DTS_TS1_ICR_IRQ_CLEAR_ALARMB_Pos            (4U)
#define DTS_TS1_ICR_IRQ_CLEAR_ALARMB_Msk            (0x1UL << DTS_TS1_ICR_IRQ_CLEAR_ALARMB_Pos)           /*!< 0x00000010 */
#define DTS_TS1_ICR_IRQ_CLEAR_ALARMB                DTS_TS1_ICR_IRQ_CLEAR_ALARMB_Msk                     /*!< Alarm B IRQ clear bit */

/***************  Bit definition for DTS_TS1IRQTESTR register  ****************/
#define DTS_TS1IRQTESTR_IRQ_TEST_FAULT_Pos          (0U)
#define DTS_TS1IRQTESTR_IRQ_TEST_FAULT_Msk          (0x1UL << DTS_TS1IRQTESTR_IRQ_TEST_FAULT_Pos)         /*!< 0x00000001 */
#define DTS_TS1IRQTESTR_IRQ_TEST_FAULT              DTS_TS1IRQTESTR_IRQ_TEST_FAULT_Msk                   /*!< Fault IRQ test bit */
#define DTS_TS1IRQTESTR_IRQ_TEST_DONE_Pos           (1U)
#define DTS_TS1IRQTESTR_IRQ_TEST_DONE_Msk           (0x1UL << DTS_TS1IRQTESTR_IRQ_TEST_DONE_Pos)          /*!< 0x00000002 */
#define DTS_TS1IRQTESTR_IRQ_TEST_DONE               DTS_TS1IRQTESTR_IRQ_TEST_DONE_Msk                    /*!< Sample done IRQ test bit */
#define DTS_TS1IRQTESTR_IRQ_TEST_ALARMA_Pos         (3U)
#define DTS_TS1IRQTESTR_IRQ_TEST_ALARMA_Msk         (0x1UL << DTS_TS1IRQTESTR_IRQ_TEST_ALARMA_Pos)        /*!< 0x00000008 */
#define DTS_TS1IRQTESTR_IRQ_TEST_ALARMA             DTS_TS1IRQTESTR_IRQ_TEST_ALARMA_Msk                  /*!< Alarm A IRQ test bit */
#define DTS_TS1IRQTESTR_IRQ_TEST_ALARMB_Pos         (4U)
#define DTS_TS1IRQTESTR_IRQ_TEST_ALARMB_Msk         (0x1UL << DTS_TS1IRQTESTR_IRQ_TEST_ALARMB_Pos)        /*!< 0x00000010 */
#define DTS_TS1IRQTESTR_IRQ_TEST_ALARMB             DTS_TS1IRQTESTR_IRQ_TEST_ALARMB_Msk                  /*!< Alarm B IRQ test bit */

