STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp235dxx_cm33.h
/**********  Bit definition for ETH_RX_RUNT_ERROR_PACKETS register  ***********/
#define ETH_RX_RUNT_ERROR_PACKETS_RXRUNTERR_Pos                         (0U)
#define ETH_RX_RUNT_ERROR_PACKETS_RXRUNTERR_Msk                         (0xFFFFFFFFUL << ETH_RX_RUNT_ERROR_PACKETS_RXRUNTERR_Pos)                 /*!< 0xFFFFFFFF */
#define ETH_RX_RUNT_ERROR_PACKETS_RXRUNTERR                             ETH_RX_RUNT_ERROR_PACKETS_RXRUNTERR_Msk                                  /*!< Rx Runt Error Packets */

/*********  Bit definition for ETH_RX_JABBER_ERROR_PACKETS register  **********/
#define ETH_RX_JABBER_ERROR_PACKETS_RXJABERR_Pos                        (0U)
#define ETH_RX_JABBER_ERROR_PACKETS_RXJABERR_Msk                        (0xFFFFFFFFUL << ETH_RX_JABBER_ERROR_PACKETS_RXJABERR_Pos)                /*!< 0xFFFFFFFF */
#define ETH_RX_JABBER_ERROR_PACKETS_RXJABERR                            ETH_RX_JABBER_ERROR_PACKETS_RXJABERR_Msk                                 /*!< Rx Jabber Error Packets */

/********  Bit definition for ETH_RX_UNDERSIZE_PACKETS_GOOD register  *********/
#define ETH_RX_UNDERSIZE_PACKETS_GOOD_RXUNDERSZG_Pos                    (0U)
#define ETH_RX_UNDERSIZE_PACKETS_GOOD_RXUNDERSZG_Msk                    (0xFFFFFFFFUL << ETH_RX_UNDERSIZE_PACKETS_GOOD_RXUNDERSZG_Pos)            /*!< 0xFFFFFFFF */
#define ETH_RX_UNDERSIZE_PACKETS_GOOD_RXUNDERSZG                        ETH_RX_UNDERSIZE_PACKETS_GOOD_RXUNDERSZG_Msk                             /*!< Rx Undersize Packets Good */

/*********  Bit definition for ETH_RX_OVERSIZE_PACKETS_GOOD register  *********/
#define ETH_RX_OVERSIZE_PACKETS_GOOD_RXOVERSZG_Pos                      (0U)
#define ETH_RX_OVERSIZE_PACKETS_GOOD_RXOVERSZG_Msk                      (0xFFFFFFFFUL << ETH_RX_OVERSIZE_PACKETS_GOOD_RXOVERSZG_Pos)              /*!< 0xFFFFFFFF */
#define ETH_RX_OVERSIZE_PACKETS_GOOD_RXOVERSZG                          ETH_RX_OVERSIZE_PACKETS_GOOD_RXOVERSZG_Msk                               /*!< Rx Oversize Packets Good */

/*******  Bit definition for ETH_RX_64OCTETS_PACKETS_GOOD_BAD register  *******/
#define ETH_RX_64OCTETS_PACKETS_GOOD_BAD_RX64OCTGB_Pos                  (0U)
#define ETH_RX_64OCTETS_PACKETS_GOOD_BAD_RX64OCTGB_Msk                  (0xFFFFFFFFUL << ETH_RX_64OCTETS_PACKETS_GOOD_BAD_RX64OCTGB_Pos)          /*!< 0xFFFFFFFF */
#define ETH_RX_64OCTETS_PACKETS_GOOD_BAD_RX64OCTGB                      ETH_RX_64OCTETS_PACKETS_GOOD_BAD_RX64OCTGB_Msk                           /*!< Rx 64 Octets Packets Good Bad */

/****  Bit definition for ETH_RX_65TO127OCTETS_PACKETS_GOOD_BAD register  *****/
#define ETH_RX_65TO127OCTETS_PACKETS_GOOD_BAD_TX65_127OCTGB_Pos         (0U)
#define ETH_RX_65TO127OCTETS_PACKETS_GOOD_BAD_TX65_127OCTGB_Msk         (0xFFFFFFFFUL << ETH_RX_65TO127OCTETS_PACKETS_GOOD_BAD_TX65_127OCTGB_Pos) /*!< 0xFFFFFFFF */
#define ETH_RX_65TO127OCTETS_PACKETS_GOOD_BAD_TX65_127OCTGB             ETH_RX_65TO127OCTETS_PACKETS_GOOD_BAD_TX65_127OCTGB_Msk                  /*!< Rx 65-127 Octets Packets Good Bad */

/****  Bit definition for ETH_RX_128TO255OCTETS_PACKETS_GOOD_BAD register  ****/
#define ETH_RX_128TO255OCTETS_PACKETS_GOOD_BAD_RX128_255OCTGB_Pos       (0U)
#define ETH_RX_128TO255OCTETS_PACKETS_GOOD_BAD_RX128_255OCTGB_Msk       (0xFFFFFFFFUL << ETH_RX_128TO255OCTETS_PACKETS_GOOD_BAD_RX128_255OCTGB_Pos) /*!< 0xFFFFFFFF */
#define ETH_RX_128TO255OCTETS_PACKETS_GOOD_BAD_RX128_255OCTGB           ETH_RX_128TO255OCTETS_PACKETS_GOOD_BAD_RX128_255OCTGB_Msk                /*!< Rx 128-255 Octets Packets Good Bad */

/****  Bit definition for ETH_RX_256TO511OCTETS_PACKETS_GOOD_BAD register  ****/
#define ETH_RX_256TO511OCTETS_PACKETS_GOOD_BAD_RX256_511OCTGB_Pos       (0U)
#define ETH_RX_256TO511OCTETS_PACKETS_GOOD_BAD_RX256_511OCTGB_Msk       (0xFFFFFFFFUL << ETH_RX_256TO511OCTETS_PACKETS_GOOD_BAD_RX256_511OCTGB_Pos) /*!< 0xFFFFFFFF */
#define ETH_RX_256TO511OCTETS_PACKETS_GOOD_BAD_RX256_511OCTGB           ETH_RX_256TO511OCTETS_PACKETS_GOOD_BAD_RX256_511OCTGB_Msk                /*!< Rx 256-511 Octets Packets Good Bad */

/***  Bit definition for ETH_RX_512TO1023OCTETS_PACKETS_GOOD_BAD register  ****/
#define ETH_RX_512TO1023OCTETS_PACKETS_GOOD_BAD_RX512_1023OCTGB_Pos     (0U)
#define ETH_RX_512TO1023OCTETS_PACKETS_GOOD_BAD_RX512_1023OCTGB_Msk     (0xFFFFFFFFUL << ETH_RX_512TO1023OCTETS_PACKETS_GOOD_BAD_RX512_1023OCTGB_Pos)   /*!< 0xFFFFFFFF */
#define ETH_RX_512TO1023OCTETS_PACKETS_GOOD_BAD_RX512_1023OCTGB         ETH_RX_512TO1023OCTETS_PACKETS_GOOD_BAD_RX512_1023OCTGB_Msk              /*!< Rx 512-1023 Octets Packets Good Bad */

/***  Bit definition for ETH_RX_1024TOMAXOCTETS_PACKETS_GOOD_BAD register  ****/
#define ETH_RX_1024TOMAXOCTETS_PACKETS_GOOD_BAD_RX1024_MAXOCTGB_Pos     (0U)
#define ETH_RX_1024TOMAXOCTETS_PACKETS_GOOD_BAD_RX1024_MAXOCTGB_Msk     (0xFFFFFFFFUL << ETH_RX_1024TOMAXOCTETS_PACKETS_GOOD_BAD_RX1024_MAXOCTGB_Pos)   /*!< 0xFFFFFFFF */
#define ETH_RX_1024TOMAXOCTETS_PACKETS_GOOD_BAD_RX1024_MAXOCTGB         ETH_RX_1024TOMAXOCTETS_PACKETS_GOOD_BAD_RX1024_MAXOCTGB_Msk              /*!< Rx 1024-Max Octets Good Bad */

/*********  Bit definition for ETH_RX_UNICAST_PACKETS_GOOD register  **********/
#define ETH_RX_UNICAST_PACKETS_GOOD_RXUCASTG_Pos                        (0U)
#define ETH_RX_UNICAST_PACKETS_GOOD_RXUCASTG_Msk                        (0xFFFFFFFFUL << ETH_RX_UNICAST_PACKETS_GOOD_RXUCASTG_Pos)                /*!< 0xFFFFFFFF */
#define ETH_RX_UNICAST_PACKETS_GOOD_RXUCASTG                            ETH_RX_UNICAST_PACKETS_GOOD_RXUCASTG_Msk                                 /*!< Rx Unicast Packets Good */

/*********  Bit definition for ETH_RX_LENGTH_ERROR_PACKETS register  **********/
#define ETH_RX_LENGTH_ERROR_PACKETS_RXLENERR_Pos                        (0U)
#define ETH_RX_LENGTH_ERROR_PACKETS_RXLENERR_Msk                        (0xFFFFFFFFUL << ETH_RX_LENGTH_ERROR_PACKETS_RXLENERR_Pos)                /*!< 0xFFFFFFFF */
#define ETH_RX_LENGTH_ERROR_PACKETS_RXLENERR                            ETH_RX_LENGTH_ERROR_PACKETS_RXLENERR_Msk                                 /*!< Rx Length Error Packets */

/*********  Bit definition for ETH_RX_OUT_OF_RANGE_PACKETS register  **********/
#define ETH_RX_OUT_OF_RANGE_PACKETS_RXOUTOFRNG_Pos                      (0U)
#define ETH_RX_OUT_OF_RANGE_PACKETS_RXOUTOFRNG_Msk                      (0xFFFFFFFFUL << ETH_RX_OUT_OF_RANGE_PACKETS_RXOUTOFRNG_Pos)              /*!< 0xFFFFFFFF */
#define ETH_RX_OUT_OF_RANGE_PACKETS_RXOUTOFRNG                          ETH_RX_OUT_OF_RANGE_PACKETS_RXOUTOFRNG_Msk                               /*!< Rx Out of Range Type Packet */

/*************  Bit definition for ETH_RX_PAUSE_PACKETS register  *************/
#define ETH_RX_PAUSE_PACKETS_RXPAUSEPKT_Pos                             (0U)
#define ETH_RX_PAUSE_PACKETS_RXPAUSEPKT_Msk                             (0xFFFFFFFFUL << ETH_RX_PAUSE_PACKETS_RXPAUSEPKT_Pos)                     /*!< 0xFFFFFFFF */
#define ETH_RX_PAUSE_PACKETS_RXPAUSEPKT                                 ETH_RX_PAUSE_PACKETS_RXPAUSEPKT_Msk                                      /*!< Rx Pause Packets */

/*********  Bit definition for ETH_RX_FIFO_OVERFLOW_PACKETS register  *********/
#define ETH_RX_FIFO_OVERFLOW_PACKETS_RXFIFOOVFL_Pos                     (0U)
#define ETH_RX_FIFO_OVERFLOW_PACKETS_RXFIFOOVFL_Msk                     (0xFFFFFFFFUL << ETH_RX_FIFO_OVERFLOW_PACKETS_RXFIFOOVFL_Pos)             /*!< 0xFFFFFFFF */
#define ETH_RX_FIFO_OVERFLOW_PACKETS_RXFIFOOVFL                         ETH_RX_FIFO_OVERFLOW_PACKETS_RXFIFOOVFL_Msk                              /*!< Rx FIFO Overflow Packets */

