STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp235dxx_cm33.h
/******************  Bit definition for EXTI2_SECCFGR1  register  ******************/
#define EXTI2_SECCFGR1_SEC0_Pos  (0U)
#define EXTI2_SECCFGR1_SEC0_Msk  (0x1UL << EXTI2_SECCFGR1_SEC0_Pos)          /*!< 0x00000001 */
#define EXTI2_SECCFGR1_SEC0      EXTI2_SECCFGR1_SEC0_Msk                    /*!< SEC/PRIV enable on event input 0 */
#define EXTI2_SECCFGR1_SEC1_Pos  (1U)
#define EXTI2_SECCFGR1_SEC1_Msk  (0x1UL << EXTI2_SECCFGR1_SEC1_Pos)          /*!< 0x00000002 */
#define EXTI2_SECCFGR1_SEC1      EXTI2_SECCFGR1_SEC1_Msk                    /*!< SEC/PRIV enable on event input 1 */
#define EXTI2_SECCFGR1_SEC2_Pos  (2U)
#define EXTI2_SECCFGR1_SEC2_Msk  (0x1UL << EXTI2_SECCFGR1_SEC2_Pos)          /*!< 0x00000004 */
#define EXTI2_SECCFGR1_SEC2      EXTI2_SECCFGR1_SEC2_Msk                    /*!< SEC/PRIV enable on event input 2 */
#define EXTI2_SECCFGR1_SEC3_Pos  (3U)
#define EXTI2_SECCFGR1_SEC3_Msk  (0x1UL << EXTI2_SECCFGR1_SEC3_Pos)          /*!< 0x00000008 */
#define EXTI2_SECCFGR1_SEC3      EXTI2_SECCFGR1_SEC3_Msk                    /*!< SEC/PRIV enable on event input 3 */
#define EXTI2_SECCFGR1_SEC4_Pos  (4U)
#define EXTI2_SECCFGR1_SEC4_Msk  (0x1UL << EXTI2_SECCFGR1_SEC4_Pos)          /*!< 0x00000010 */
#define EXTI2_SECCFGR1_SEC4      EXTI2_SECCFGR1_SEC4_Msk                    /*!< SEC/PRIV enable on event input 4 */
#define EXTI2_SECCFGR1_SEC5_Pos  (5U)
#define EXTI2_SECCFGR1_SEC5_Msk  (0x1UL << EXTI2_SECCFGR1_SEC5_Pos)          /*!< 0x00000020 */
#define EXTI2_SECCFGR1_SEC5      EXTI2_SECCFGR1_SEC5_Msk                    /*!< SEC/PRIV enable on event input 5 */
#define EXTI2_SECCFGR1_SEC6_Pos  (6U)
#define EXTI2_SECCFGR1_SEC6_Msk  (0x1UL << EXTI2_SECCFGR1_SEC6_Pos)          /*!< 0x00000040 */
#define EXTI2_SECCFGR1_SEC6      EXTI2_SECCFGR1_SEC6_Msk                    /*!< SEC/PRIV enable on event input 6 */
#define EXTI2_SECCFGR1_SEC7_Pos  (7U)
#define EXTI2_SECCFGR1_SEC7_Msk  (0x1UL << EXTI2_SECCFGR1_SEC7_Pos)          /*!< 0x00000080 */
#define EXTI2_SECCFGR1_SEC7      EXTI2_SECCFGR1_SEC7_Msk                    /*!< SEC/PRIV enable on event input 7 */
#define EXTI2_SECCFGR1_SEC8_Pos  (8U)
#define EXTI2_SECCFGR1_SEC8_Msk  (0x1UL << EXTI2_SECCFGR1_SEC8_Pos)          /*!< 0x00000100 */
#define EXTI2_SECCFGR1_SEC8      EXTI2_SECCFGR1_SEC8_Msk                    /*!< SEC/PRIV enable on event input 8 */
#define EXTI2_SECCFGR1_SEC9_Pos  (9U)
#define EXTI2_SECCFGR1_SEC9_Msk  (0x1UL << EXTI2_SECCFGR1_SEC9_Pos)          /*!< 0x00000200 */
#define EXTI2_SECCFGR1_SEC9      EXTI2_SECCFGR1_SEC9_Msk                    /*!< SEC/PRIV enable on event input 9 */
#define EXTI2_SECCFGR1_SEC10_Pos (10U)
#define EXTI2_SECCFGR1_SEC10_Msk (0x1UL << EXTI2_SECCFGR1_SEC10_Pos)         /*!< 0x00000400 */
#define EXTI2_SECCFGR1_SEC10     EXTI2_SECCFGR1_SEC10_Msk                   /*!< SEC/PRIV enable on event input 10 */
#define EXTI2_SECCFGR1_SEC11_Pos (11U)
#define EXTI2_SECCFGR1_SEC11_Msk (0x1UL << EXTI2_SECCFGR1_SEC11_Pos)         /*!< 0x00000800 */
#define EXTI2_SECCFGR1_SEC11     EXTI2_SECCFGR1_SEC11_Msk                   /*!< SEC/PRIV enable on event input 11 */
#define EXTI2_SECCFGR1_SEC12_Pos (12U)
#define EXTI2_SECCFGR1_SEC12_Msk (0x1UL << EXTI2_SECCFGR1_SEC12_Pos)         /*!< 0x00001000 */
#define EXTI2_SECCFGR1_SEC12     EXTI2_SECCFGR1_SEC12_Msk                   /*!< SEC/PRIV enable on event input 12 */
#define EXTI2_SECCFGR1_SEC13_Pos (13U)
#define EXTI2_SECCFGR1_SEC13_Msk (0x1UL << EXTI2_SECCFGR1_SEC13_Pos)         /*!< 0x00002000 */
#define EXTI2_SECCFGR1_SEC13     EXTI2_SECCFGR1_SEC13_Msk                   /*!< SEC/PRIV enable on event input 13 */
#define EXTI2_SECCFGR1_SEC14_Pos (14U)
#define EXTI2_SECCFGR1_SEC14_Msk (0x1UL << EXTI2_SECCFGR1_SEC14_Pos)         /*!< 0x00004000 */
#define EXTI2_SECCFGR1_SEC14     EXTI2_SECCFGR1_SEC14_Msk                   /*!< SEC/PRIV enable on event input 14 */
#define EXTI2_SECCFGR1_SEC15_Pos (15U)
#define EXTI2_SECCFGR1_SEC15_Msk (0x1UL << EXTI2_SECCFGR1_SEC15_Pos)         /*!< 0x00008000 */
#define EXTI2_SECCFGR1_SEC15     EXTI2_SECCFGR1_SEC15_Msk                   /*!< SEC/PRIV enable on event input 15 */
#define EXTI2_SECCFGR1_SEC16_Pos (16U)
#define EXTI2_SECCFGR1_SEC16_Msk (0x1UL << EXTI2_SECCFGR1_SEC16_Pos)         /*!< 0x00010000 */
#define EXTI2_SECCFGR1_SEC16     EXTI2_SECCFGR1_SEC16_Msk                   /*!< SEC/PRIV enable on event input 16 */
#define EXTI2_SECCFGR1_SEC17_Pos (17U)
#define EXTI2_SECCFGR1_SEC17_Msk (0x1UL << EXTI2_SECCFGR1_SEC17_Pos)         /*!< 0x00020000 */
#define EXTI2_SECCFGR1_SEC17     EXTI2_SECCFGR1_SEC17_Msk                   /*!< SEC/PRIV enable on event input 17 */
#define EXTI2_SECCFGR1_SEC18_Pos (18U)
#define EXTI2_SECCFGR1_SEC18_Msk (0x1UL << EXTI2_SECCFGR1_SEC18_Pos)         /*!< 0x00040000 */
#define EXTI2_SECCFGR1_SEC18     EXTI2_SECCFGR1_SEC18_Msk                   /*!< SEC/PRIV enable on event input 18 */
#define EXTI2_SECCFGR1_SEC19_Pos (19U)
#define EXTI2_SECCFGR1_SEC19_Msk (0x1UL << EXTI2_SECCFGR1_SEC19_Pos)         /*!< 0x00080000 */
#define EXTI2_SECCFGR1_SEC19     EXTI2_SECCFGR1_SEC19_Msk                   /*!< SEC/PRIV enable on event input 19 */
#define EXTI2_SECCFGR1_SEC20_Pos (20U)
#define EXTI2_SECCFGR1_SEC20_Msk (0x1UL << EXTI2_SECCFGR1_SEC20_Pos)         /*!< 0x00100000 */
#define EXTI2_SECCFGR1_SEC20     EXTI2_SECCFGR1_SEC20_Msk                   /*!< SEC/PRIV enable on event input 20 */
#define EXTI2_SECCFGR1_SEC21_Pos (21U)
#define EXTI2_SECCFGR1_SEC21_Msk (0x1UL << EXTI2_SECCFGR1_SEC21_Pos)         /*!< 0x00200000 */
#define EXTI2_SECCFGR1_SEC21     EXTI2_SECCFGR1_SEC21_Msk                   /*!< SEC/PRIV enable on event input 21 */
#define EXTI2_SECCFGR1_SEC22_Pos (22U)
#define EXTI2_SECCFGR1_SEC22_Msk (0x1UL << EXTI2_SECCFGR1_SEC22_Pos)         /*!< 0x00400000 */
#define EXTI2_SECCFGR1_SEC22     EXTI2_SECCFGR1_SEC22_Msk                   /*!< SEC/PRIV enable on event input 22 */
#define EXTI2_SECCFGR1_SEC23_Pos (23U)
#define EXTI2_SECCFGR1_SEC23_Msk (0x1UL << EXTI2_SECCFGR1_SEC23_Pos)         /*!< 0x00800000 */
#define EXTI2_SECCFGR1_SEC23     EXTI2_SECCFGR1_SEC23_Msk                   /*!< SEC/PRIV enable on event input 23 */
#define EXTI2_SECCFGR1_SEC24_Pos (24U)
#define EXTI2_SECCFGR1_SEC24_Msk (0x1UL << EXTI2_SECCFGR1_SEC24_Pos)         /*!< 0x01000000 */
#define EXTI2_SECCFGR1_SEC24     EXTI2_SECCFGR1_SEC24_Msk                   /*!< SEC/PRIV enable on event input 24 */
#define EXTI2_SECCFGR1_SEC25_Pos (25U)
#define EXTI2_SECCFGR1_SEC25_Msk (0x1UL << EXTI2_SECCFGR1_SEC25_Pos)         /*!< 0x02000000 */
#define EXTI2_SECCFGR1_SEC25     EXTI2_SECCFGR1_SEC25_Msk                   /*!< SEC/PRIV enable on event input 25 */
#define EXTI2_SECCFGR1_SEC26_Pos (26U)
#define EXTI2_SECCFGR1_SEC26_Msk (0x1UL << EXTI2_SECCFGR1_SEC26_Pos)         /*!< 0x04000000 */
#define EXTI2_SECCFGR1_SEC26     EXTI2_SECCFGR1_SEC26_Msk                   /*!< SEC/PRIV enable on event input 26 */
#define EXTI2_SECCFGR1_SEC27_Pos (27U)
#define EXTI2_SECCFGR1_SEC27_Msk (0x1UL << EXTI2_SECCFGR1_SEC27_Pos)         /*!< 0x08000000 */
#define EXTI2_SECCFGR1_SEC27     EXTI2_SECCFGR1_SEC27_Msk                   /*!< SEC/PRIV enable on event input 27 */
/* no event input 28  */
#define EXTI2_SECCFGR1_SEC29_Pos (29U)
#define EXTI2_SECCFGR1_SEC29_Msk (0x1UL << EXTI2_SECCFGR1_SEC29_Pos)         /*!< 0x20000000 */
#define EXTI2_SECCFGR1_SEC29     EXTI2_SECCFGR1_SEC29_Msk                   /*!< SEC/PRIV enable on event input 29 */
#define EXTI2_SECCFGR1_SEC30_Pos (30U)
#define EXTI2_SECCFGR1_SEC30_Msk (0x1UL << EXTI2_SECCFGR1_SEC30_Pos)         /*!< 0x40000000 */
#define EXTI2_SECCFGR1_SEC30     EXTI2_SECCFGR1_SEC30_Msk                   /*!< SEC/PRIV enable on event input 30 */
#define EXTI2_SECCFGR1_SEC31_Pos (31U)
#define EXTI2_SECCFGR1_SEC31_Msk (0x1UL << EXTI2_SECCFGR1_SEC31_Pos)         /*!< 0x80000000 */
#define EXTI2_SECCFGR1_SEC31     EXTI2_SECCFGR1_SEC31_Msk                   /*!< SEC/PRIV enable on event input 31 */

