STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp235dxx_cm33.h
/******************  Bit definition for LPTIM_CCR1 register  ******************/
#define LPTIM_CCR1_CCR1_Pos          (0U)
#define LPTIM_CCR1_CCR1_Msk          (0xFFFFUL << LPTIM_CCR1_CCR1_Pos)        /*!< 0x0000FFFF */
#define LPTIM_CCR1_CCR1              LPTIM_CCR1_CCR1_Msk                     /*!< Capture/compare 1 value */

/******************  Bit definition for LPTIM_ARR register  *******************/
#define LPTIM_ARR_ARR_Pos            (0U)
#define LPTIM_ARR_ARR_Msk            (0xFFFFUL << LPTIM_ARR_ARR_Pos)          /*!< 0x0000FFFF */
#define LPTIM_ARR_ARR                LPTIM_ARR_ARR_Msk                       /*!< Auto reload value */

/******************  Bit definition for LPTIM_CNT register  *******************/
#define LPTIM_CNT_CNT_Pos            (0U)
#define LPTIM_CNT_CNT_Msk            (0xFFFFUL << LPTIM_CNT_CNT_Pos)          /*!< 0x0000FFFF */
#define LPTIM_CNT_CNT                LPTIM_CNT_CNT_Msk                       /*!< Counter value */

/******************  Bit definition for LPTIM1_OR register  *******************/
#define LPTIM1_OR_OR_0_Pos            (0U)
#define LPTIM1_OR_OR_0_Msk            (0x1UL << LPTIM1_OR_OR_0_Pos)           /*!< 0x00000001 */
#define LPTIM1_OR_OR_0                LPTIM1_OR_OR_0_Msk                     /*!< Option register bit 0 */

/*****************  Bit definition for LPTIM_CFGR2 register  ******************/
#define LPTIM_CFGR2_IN1SEL_Pos       (0U)
#define LPTIM_CFGR2_IN1SEL_Msk       (0x3UL << LPTIM_CFGR2_IN1SEL_Pos)        /*!< 0x00000003 */
#define LPTIM_CFGR2_IN1SEL           LPTIM_CFGR2_IN1SEL_Msk                  /*!< LPTIM input 1 selection */
#define LPTIM_CFGR2_IN1SEL_0         (0x1UL << LPTIM_CFGR2_IN1SEL_Pos)        /*!< 0x00000001 */
#define LPTIM_CFGR2_IN1SEL_1         (0x2UL << LPTIM_CFGR2_IN1SEL_Pos)        /*!< 0x00000002 */
#define LPTIM_CFGR2_IN2SEL_Pos       (4U)
#define LPTIM_CFGR2_IN2SEL_Msk       (0x3UL << LPTIM_CFGR2_IN2SEL_Pos)        /*!< 0x00000030 */
#define LPTIM_CFGR2_IN2SEL           LPTIM_CFGR2_IN2SEL_Msk                  /*!< LPTIM input 2 selection */
#define LPTIM_CFGR2_IN2SEL_0         (0x1UL << LPTIM_CFGR2_IN2SEL_Pos)        /*!< 0x00000010 */
#define LPTIM_CFGR2_IN2SEL_1         (0x2UL << LPTIM_CFGR2_IN2SEL_Pos)        /*!< 0x00000020 */
#define LPTIM_CFGR2_IC1SEL_Pos       (16U)
#define LPTIM_CFGR2_IC1SEL_Msk       (0x3UL << LPTIM_CFGR2_IC1SEL_Pos)        /*!< 0x00030000 */
#define LPTIM_CFGR2_IC1SEL           LPTIM_CFGR2_IC1SEL_Msk                  /*!< LPTIM input capture 1 selection */
#define LPTIM_CFGR2_IC1SEL_0         (0x1UL << LPTIM_CFGR2_IC1SEL_Pos)        /*!< 0x00010000 */
#define LPTIM_CFGR2_IC1SEL_1         (0x2UL << LPTIM_CFGR2_IC1SEL_Pos)        /*!< 0x00020000 */
#define LPTIM_CFGR2_IC2SEL_Pos       (20U)
#define LPTIM_CFGR2_IC2SEL_Msk       (0x3UL << LPTIM_CFGR2_IC2SEL_Pos)        /*!< 0x00300000 */
#define LPTIM_CFGR2_IC2SEL           LPTIM_CFGR2_IC2SEL_Msk                  /*!< LPTIM input capture 2 selection */
#define LPTIM_CFGR2_IC2SEL_0         (0x1UL << LPTIM_CFGR2_IC2SEL_Pos)        /*!< 0x00100000 */
#define LPTIM_CFGR2_IC2SEL_1         (0x2UL << LPTIM_CFGR2_IC2SEL_Pos)        /*!< 0x00200000 */

/******************  Bit definition for LPTIM_RCR register  *******************/
#define LPTIM_RCR_REP_Pos            (0U)
#define LPTIM_RCR_REP_Msk            (0xFFUL << LPTIM_RCR_REP_Pos)            /*!< 0x000000FF */
#define LPTIM_RCR_REP                LPTIM_RCR_REP_Msk                       /*!< Repetition register value */

/*****************  Bit definition for LPTIM_CCMR1 register  ******************/
#define LPTIM_CCMR1_CC1SEL_Pos       (0U)
#define LPTIM_CCMR1_CC1SEL_Msk       (0x1UL << LPTIM_CCMR1_CC1SEL_Pos)        /*!< 0x00000001 */
#define LPTIM_CCMR1_CC1SEL           LPTIM_CCMR1_CC1SEL_Msk                  /*!< Capture/compare 1 selection */
#define LPTIM_CCMR1_CC1E_Pos         (1U)
#define LPTIM_CCMR1_CC1E_Msk         (0x1UL << LPTIM_CCMR1_CC1E_Pos)          /*!< 0x00000002 */
#define LPTIM_CCMR1_CC1E             LPTIM_CCMR1_CC1E_Msk                    /*!< Capture/compare 1 output enable */
#define LPTIM_CCMR1_CC1P_Pos         (2U)
#define LPTIM_CCMR1_CC1P_Msk         (0x3UL << LPTIM_CCMR1_CC1P_Pos)          /*!< 0x0000000C */
#define LPTIM_CCMR1_CC1P             LPTIM_CCMR1_CC1P_Msk                    /*!< Capture/compare 1 output polarity */
#define LPTIM_CCMR1_CC1P_0           (0x1UL << LPTIM_CCMR1_CC1P_Pos)          /*!< 0x00000004 */
#define LPTIM_CCMR1_CC1P_1           (0x2UL << LPTIM_CCMR1_CC1P_Pos)          /*!< 0x00000008 */
#define LPTIM_CCMR1_IC1PSC_Pos       (8U)
#define LPTIM_CCMR1_IC1PSC_Msk       (0x3UL << LPTIM_CCMR1_IC1PSC_Pos)        /*!< 0x00000300 */
#define LPTIM_CCMR1_IC1PSC           LPTIM_CCMR1_IC1PSC_Msk                  /*!< Input capture 1 prescaler */
#define LPTIM_CCMR1_IC1PSC_0         (0x1UL << LPTIM_CCMR1_IC1PSC_Pos)        /*!< 0x00000100 */
#define LPTIM_CCMR1_IC1PSC_1         (0x2UL << LPTIM_CCMR1_IC1PSC_Pos)        /*!< 0x00000200 */
#define LPTIM_CCMR1_IC1F_Pos         (12U)
#define LPTIM_CCMR1_IC1F_Msk         (0x3UL << LPTIM_CCMR1_IC1F_Pos)          /*!< 0x00003000 */
#define LPTIM_CCMR1_IC1F             LPTIM_CCMR1_IC1F_Msk                    /*!< Input capture 1 filter */
#define LPTIM_CCMR1_IC1F_0           (0x1UL << LPTIM_CCMR1_IC1F_Pos)          /*!< 0x00001000 */
#define LPTIM_CCMR1_IC1F_1           (0x2UL << LPTIM_CCMR1_IC1F_Pos)          /*!< 0x00002000 */
#define LPTIM_CCMR1_CC2SEL_Pos       (16U)
#define LPTIM_CCMR1_CC2SEL_Msk       (0x1UL << LPTIM_CCMR1_CC2SEL_Pos)        /*!< 0x00010000 */
#define LPTIM_CCMR1_CC2SEL           LPTIM_CCMR1_CC2SEL_Msk                  /*!< Capture/compare 2 selection */
#define LPTIM_CCMR1_CC2E_Pos         (17U)
#define LPTIM_CCMR1_CC2E_Msk         (0x1UL << LPTIM_CCMR1_CC2E_Pos)          /*!< 0x00020000 */
#define LPTIM_CCMR1_CC2E             LPTIM_CCMR1_CC2E_Msk                    /*!< Capture/compare 2 output enable */
#define LPTIM_CCMR1_CC2P_Pos         (18U)
#define LPTIM_CCMR1_CC2P_Msk         (0x3UL << LPTIM_CCMR1_CC2P_Pos)          /*!< 0x000C0000 */
#define LPTIM_CCMR1_CC2P             LPTIM_CCMR1_CC2P_Msk                    /*!< Capture/compare 2 output polarity */
#define LPTIM_CCMR1_CC2P_0           (0x1UL << LPTIM_CCMR1_CC2P_Pos)          /*!< 0x00040000 */
#define LPTIM_CCMR1_CC2P_1           (0x2UL << LPTIM_CCMR1_CC2P_Pos)          /*!< 0x00080000 */
#define LPTIM_CCMR1_IC2PSC_Pos       (24U)
#define LPTIM_CCMR1_IC2PSC_Msk       (0x3UL << LPTIM_CCMR1_IC2PSC_Pos)        /*!< 0x03000000 */
#define LPTIM_CCMR1_IC2PSC           LPTIM_CCMR1_IC2PSC_Msk                  /*!< Input capture 2 prescaler */
#define LPTIM_CCMR1_IC2PSC_0         (0x1UL << LPTIM_CCMR1_IC2PSC_Pos)        /*!< 0x01000000 */
#define LPTIM_CCMR1_IC2PSC_1         (0x2UL << LPTIM_CCMR1_IC2PSC_Pos)        /*!< 0x02000000 */
#define LPTIM_CCMR1_IC2F_Pos         (28U)
#define LPTIM_CCMR1_IC2F_Msk         (0x3UL << LPTIM_CCMR1_IC2F_Pos)          /*!< 0x30000000 */
#define LPTIM_CCMR1_IC2F             LPTIM_CCMR1_IC2F_Msk                    /*!< Input capture 2 filter */
#define LPTIM_CCMR1_IC2F_0           (0x1UL << LPTIM_CCMR1_IC2F_Pos)          /*!< 0x10000000 */
#define LPTIM_CCMR1_IC2F_1           (0x2UL << LPTIM_CCMR1_IC2F_Pos)          /*!< 0x20000000 */

/******************  Bit definition for LPTIM_CCR2 register  ******************/
#define LPTIM_CCR2_CCR2_Pos          (0U)
#define LPTIM_CCR2_CCR2_Msk          (0xFFFFUL << LPTIM_CCR2_CCR2_Pos)        /*!< 0x0000FFFF */
#define LPTIM_CCR2_CCR2              LPTIM_CCR2_CCR2_Msk                     /*!< Capture/compare 2 value */

