STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp235dxx_cm33.h
/* Bit fields for RCC_PLL3CFGR7 register */
#define RCC_PLL3CFGR7_POSTDIV2_Pos                   (0U)
#define RCC_PLL3CFGR7_POSTDIV2_Msk                   (0x7UL << RCC_PLL3CFGR7_POSTDIV2_Pos)                  /*!< 0x00000007 */
#define RCC_PLL3CFGR7_POSTDIV2                       RCC_PLL3CFGR7_POSTDIV2_Msk                            /*!< PLLx VCO frequency divide level 2 */

/* Bit fields for RCC_HSIFMONCR register */
#define RCC_HSIFMONCR_HSIREF_Pos                     (0U)
#define RCC_HSIFMONCR_HSIREF_Msk                     (0x7FFUL << RCC_HSIFMONCR_HSIREF_Pos)                  /*!< 0x000007FF */
#define RCC_HSIFMONCR_HSIREF                         RCC_HSIFMONCR_HSIREF_Msk                              /*!< HSI clock count reference value */
#define RCC_HSIFMONCR_HSIMONEN_Pos                   (15U)
#define RCC_HSIFMONCR_HSIMONEN_Msk                   (0x1UL << RCC_HSIFMONCR_HSIMONEN_Pos)                  /*!< 0x00008000 */
#define RCC_HSIFMONCR_HSIMONEN                       RCC_HSIFMONCR_HSIMONEN_Msk                            /*!< HSI clock period monitor enable */
#define RCC_HSIFMONCR_HSIDEV_Pos                     (16U)
#define RCC_HSIFMONCR_HSIDEV_Msk                     (0x3FUL << RCC_HSIFMONCR_HSIDEV_Pos)                   /*!< 0x003F0000 */
#define RCC_HSIFMONCR_HSIDEV                         RCC_HSIFMONCR_HSIDEV_Msk                              /*!< HSI clock count deviation value */
#define RCC_HSIFMONCR_HSIMONIE_Pos                   (30U)
#define RCC_HSIFMONCR_HSIMONIE_Msk                   (0x1UL << RCC_HSIFMONCR_HSIMONIE_Pos)                  /*!< 0x40000000 */
#define RCC_HSIFMONCR_HSIMONIE                       RCC_HSIFMONCR_HSIMONIE_Msk                            /*!< HSI clock period monitor interrupt enable */
#define RCC_HSIFMONCR_HSIMONF_Pos                    (31U)
#define RCC_HSIFMONCR_HSIMONF_Msk                    (0x1UL << RCC_HSIFMONCR_HSIMONF_Pos)                   /*!< 0x80000000 */
#define RCC_HSIFMONCR_HSIMONF                        RCC_HSIFMONCR_HSIMONF_Msk                             /*!< HSI clock period monitor interrupt flag */

/* Bit fields for RCC_HSIFVALR register */
#define RCC_HSIFVALR_HSIVAL_Pos                      (0U)
#define RCC_HSIFVALR_HSIVAL_Msk                      (0x7FFUL << RCC_HSIFVALR_HSIVAL_Pos)                   /*!< 0x000007FF */
#define RCC_HSIFVALR_HSIVAL                          RCC_HSIFVALR_HSIVAL_Msk                               /*!< HSI clock-cycle counter value */

/* Bit fields for RCC_TIM1CFGR register */
#define RCC_TIM1CFGR_TIM1RST_Pos                     (0U)
#define RCC_TIM1CFGR_TIM1RST_Msk                     (0x1UL << RCC_TIM1CFGR_TIM1RST_Pos)                    /*!< 0x00000001 */
#define RCC_TIM1CFGR_TIM1RST                         RCC_TIM1CFGR_TIM1RST_Msk                              /*!< TIM1 reset */
#define RCC_TIM1CFGR_TIM1EN_Pos                      (1U)
#define RCC_TIM1CFGR_TIM1EN_Msk                      (0x1UL << RCC_TIM1CFGR_TIM1EN_Pos)                     /*!< 0x00000002 */
#define RCC_TIM1CFGR_TIM1EN                          RCC_TIM1CFGR_TIM1EN_Msk                               /*!< TIM1 clock enable */
#define RCC_TIM1CFGR_TIM1LPEN_Pos                    (2U)
#define RCC_TIM1CFGR_TIM1LPEN_Msk                    (0x1UL << RCC_TIM1CFGR_TIM1LPEN_Pos)                   /*!< 0x00000004 */
#define RCC_TIM1CFGR_TIM1LPEN                        RCC_TIM1CFGR_TIM1LPEN_Msk                             /*!< TIM1 clock enable during CSleep  */

/* Bit fields for RCC_TIM2CFGR register */
#define RCC_TIM2CFGR_TIM2RST_Pos                     (0U)
#define RCC_TIM2CFGR_TIM2RST_Msk                     (0x1UL << RCC_TIM2CFGR_TIM2RST_Pos)                    /*!< 0x00000001 */
#define RCC_TIM2CFGR_TIM2RST                         RCC_TIM2CFGR_TIM2RST_Msk                              /*!< TIM2 reset */
#define RCC_TIM2CFGR_TIM2EN_Pos                      (1U)
#define RCC_TIM2CFGR_TIM2EN_Msk                      (0x1UL << RCC_TIM2CFGR_TIM2EN_Pos)                     /*!< 0x00000002 */
#define RCC_TIM2CFGR_TIM2EN                          RCC_TIM2CFGR_TIM2EN_Msk                               /*!< TIM2 clock enable */
#define RCC_TIM2CFGR_TIM2LPEN_Pos                    (2U)
#define RCC_TIM2CFGR_TIM2LPEN_Msk                    (0x1UL << RCC_TIM2CFGR_TIM2LPEN_Pos)                   /*!< 0x00000004 */
#define RCC_TIM2CFGR_TIM2LPEN                        RCC_TIM2CFGR_TIM2LPEN_Msk                             /*!< TIM2 clock enable during CSleep */

/* Bit fields for RCC_TIM3CFGR register */
#define RCC_TIM3CFGR_TIM3RST_Pos                     (0U)
#define RCC_TIM3CFGR_TIM3RST_Msk                     (0x1UL << RCC_TIM3CFGR_TIM3RST_Pos)                    /*!< 0x00000001 */
#define RCC_TIM3CFGR_TIM3RST                         RCC_TIM3CFGR_TIM3RST_Msk                              /*!< TIM3 reset */
#define RCC_TIM3CFGR_TIM3EN_Pos                      (1U)
#define RCC_TIM3CFGR_TIM3EN_Msk                      (0x1UL << RCC_TIM3CFGR_TIM3EN_Pos)                     /*!< 0x00000002 */
#define RCC_TIM3CFGR_TIM3EN                          RCC_TIM3CFGR_TIM3EN_Msk                               /*!< TIM3 clock enable */
#define RCC_TIM3CFGR_TIM3LPEN_Pos                    (2U)
#define RCC_TIM3CFGR_TIM3LPEN_Msk                    (0x1UL << RCC_TIM3CFGR_TIM3LPEN_Pos)                   /*!< 0x00000004 */
#define RCC_TIM3CFGR_TIM3LPEN                        RCC_TIM3CFGR_TIM3LPEN_Msk                             /*!< TIM3 clock enable during CSleep */

/* Bit fields for RCC_TIM4CFGR register */
#define RCC_TIM4CFGR_TIM4RST_Pos                     (0U)
#define RCC_TIM4CFGR_TIM4RST_Msk                     (0x1UL << RCC_TIM4CFGR_TIM4RST_Pos)                    /*!< 0x00000001 */
#define RCC_TIM4CFGR_TIM4RST                         RCC_TIM4CFGR_TIM4RST_Msk                              /*!< TIM4 reset */
#define RCC_TIM4CFGR_TIM4EN_Pos                      (1U)
#define RCC_TIM4CFGR_TIM4EN_Msk                      (0x1UL << RCC_TIM4CFGR_TIM4EN_Pos)                     /*!< 0x00000002 */
#define RCC_TIM4CFGR_TIM4EN                          RCC_TIM4CFGR_TIM4EN_Msk                               /*!< TIM4 clock enable */
#define RCC_TIM4CFGR_TIM4LPEN_Pos                    (2U)
#define RCC_TIM4CFGR_TIM4LPEN_Msk                    (0x1UL << RCC_TIM4CFGR_TIM4LPEN_Pos)                   /*!< 0x00000004 */
#define RCC_TIM4CFGR_TIM4LPEN                        RCC_TIM4CFGR_TIM4LPEN_Msk                             /*!< TIM4 clock enable during CSleep */

/* Bit fields for RCC_TIM5CFGR register */
#define RCC_TIM5CFGR_TIM5RST_Pos                     (0U)
#define RCC_TIM5CFGR_TIM5RST_Msk                     (0x1UL << RCC_TIM5CFGR_TIM5RST_Pos)                    /*!< 0x00000001 */
#define RCC_TIM5CFGR_TIM5RST                         RCC_TIM5CFGR_TIM5RST_Msk                              /*!< TIM5 reset */
#define RCC_TIM5CFGR_TIM5EN_Pos                      (1U)
#define RCC_TIM5CFGR_TIM5EN_Msk                      (0x1UL << RCC_TIM5CFGR_TIM5EN_Pos)                     /*!< 0x00000002 */
#define RCC_TIM5CFGR_TIM5EN                          RCC_TIM5CFGR_TIM5EN_Msk                               /*!< TIM5 clock enable */
#define RCC_TIM5CFGR_TIM5LPEN_Pos                    (2U)
#define RCC_TIM5CFGR_TIM5LPEN_Msk                    (0x1UL << RCC_TIM5CFGR_TIM5LPEN_Pos)                   /*!< 0x00000004 */
#define RCC_TIM5CFGR_TIM5LPEN                        RCC_TIM5CFGR_TIM5LPEN_Msk                             /*!< TIM5 clock enable during CSleep */

/* Bit fields for RCC_TIM6CFGR register */
#define RCC_TIM6CFGR_TIM6RST_Pos                     (0U)
#define RCC_TIM6CFGR_TIM6RST_Msk                     (0x1UL << RCC_TIM6CFGR_TIM6RST_Pos)                    /*!< 0x00000001 */
#define RCC_TIM6CFGR_TIM6RST                         RCC_TIM6CFGR_TIM6RST_Msk                              /*!< TIM6 reset */
#define RCC_TIM6CFGR_TIM6EN_Pos                      (1U)
#define RCC_TIM6CFGR_TIM6EN_Msk                      (0x1UL << RCC_TIM6CFGR_TIM6EN_Pos)                     /*!< 0x00000002 */
#define RCC_TIM6CFGR_TIM6EN                          RCC_TIM6CFGR_TIM6EN_Msk                               /*!< TIM6 clock enable */
#define RCC_TIM6CFGR_TIM6LPEN_Pos                    (2U)
#define RCC_TIM6CFGR_TIM6LPEN_Msk                    (0x1UL << RCC_TIM6CFGR_TIM6LPEN_Pos)                   /*!< 0x00000004 */
#define RCC_TIM6CFGR_TIM6LPEN                        RCC_TIM6CFGR_TIM6LPEN_Msk                             /*!< TIM6 clock enable during CSleep */

/* Bit fields for RCC_TIM7CFGR register */
#define RCC_TIM7CFGR_TIM7RST_Pos                     (0U)
#define RCC_TIM7CFGR_TIM7RST_Msk                     (0x1UL << RCC_TIM7CFGR_TIM7RST_Pos)                    /*!< 0x00000001 */
#define RCC_TIM7CFGR_TIM7RST                         RCC_TIM7CFGR_TIM7RST_Msk                              /*!< TIM7 reset */
#define RCC_TIM7CFGR_TIM7EN_Pos                      (1U)
#define RCC_TIM7CFGR_TIM7EN_Msk                      (0x1UL << RCC_TIM7CFGR_TIM7EN_Pos)                     /*!< 0x00000002 */
#define RCC_TIM7CFGR_TIM7EN                          RCC_TIM7CFGR_TIM7EN_Msk                               /*!< TIM7 clock enable */
#define RCC_TIM7CFGR_TIM7LPEN_Pos                    (2U)
#define RCC_TIM7CFGR_TIM7LPEN_Msk                    (0x1UL << RCC_TIM7CFGR_TIM7LPEN_Pos)                   /*!< 0x00000004 */
#define RCC_TIM7CFGR_TIM7LPEN                        RCC_TIM7CFGR_TIM7LPEN_Msk                             /*!< TIM7 clock enable during CSleep */

