STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp235dxx_cm33.h
#define USBH_EHCI_INSNREG03_EN_CLK256_CHECK_Pos     (14U)
#define USBH_EHCI_INSNREG03_EN_CLK256_CHECK_Msk     (0x1U << USBH_EHCI_INSNREG03_EN_CLK256_CHECK_Pos)          /*!< 0x00004000 */
#define USBH_EHCI_INSNREG03_EN_CLK256_CHECK         USBH_EHCI_INSNREG03_EN_CLK256_CHECK_Msk                    /*!< Enable 256 clock checking */

#define USBH_EHCI_INSNREG03_ENABLE_LS_GLITCH_Pos    (16U)
#define USBH_EHCI_INSNREG03_ENABLE_LS_GLITCH_Msk    (0x1U << USBH_EHCI_INSNREG03_ENABLE_LS_GLITCH_Pos)         /*!< 0x00010000 */
#define USBH_EHCI_INSNREG03_ENABLE_LS_GLITCH        USBH_EHCI_INSNREG03_ENABLE_LS_GLITCH_Msk                   /*!< Enable/disable enhancement for line state glitch */

/********************  Bit definition for USBH_EHCI_INSNREG04 register  **********************/
#define USBH_EHCI_INSNREG04_HCSPARAMS_WRT_Pos       (0U)
#define USBH_EHCI_INSNREG04_HCSPARAMS_WRT_Msk       (0x1U << USBH_EHCI_INSNREG04_HCSPARAMS_WRT_Pos)            /*!< 0x00000001 */
#define USBH_EHCI_INSNREG04_HCSPARAMS_WRT           USBH_EHCI_INSNREG04_HCSPARAMS_WRT_Msk                      /*!< Bit 0 */

#define USBH_EHCI_INSNREG04_HCCPARAMS_WRT_Pos       (1U)
#define USBH_EHCI_INSNREG04_HCCPARAMS_WRT_Msk       (0x1U << USBH_EHCI_INSNREG04_HCCPARAMS_WRT_Pos)            /*!< 0x00000002 */
#define USBH_EHCI_INSNREG04_HCCPARAMS_WRT           USBH_EHCI_INSNREG04_HCCPARAMS_WRT_Msk                      /*!< When this bit is 1, the USBH_EHCI_HCSPARAMS register becomes writable */

#define USBH_EHCI_INSNREG04_ASYNC_PIPELINE_DIS_Pos  (3U)
#define USBH_EHCI_INSNREG04_ASYNC_PIPELINE_DIS_Msk  (0x1U << USBH_EHCI_INSNREG04_ASYNC_PIPELINE_DIS_Pos)       /*!< 0x00000008 */
#define USBH_EHCI_INSNREG04_ASYNC_PIPELINE_DIS      USBH_EHCI_INSNREG04_ASYNC_PIPELINE_DIS_Msk                 /*!< When this bit is 1, the USBH_EHCI_HCCPARAMS register bits 17, 15:4, and 2:0 become writable */

#define USBH_EHCI_INSNREG04_SUSPEND_SIGNAL_Pos      (5U)
#define USBH_EHCI_INSNREG04_SUSPEND_SIGNAL_Msk      (0x1U << USBH_EHCI_INSNREG04_SUSPEND_SIGNAL_Pos)           /*!< 0x00000020 */
#define USBH_EHCI_INSNREG04_SUSPEND_SIGNAL          USBH_EHCI_INSNREG04_SUSPEND_SIGNAL_Msk                     /*!< Suspend signal */

/********************  Bit definition for USBH_EHCI_INSNREG05 register  **********************/
#define USBH_EHCI_INSNREG05_VSTATUS_Pos             (0U)
#define USBH_EHCI_INSNREG05_VSTATUS_Msk             (0xFFU << USBH_EHCI_INSNREG05_VSTATUS_Pos)                 /*!< 0x000000FF */
#define USBH_EHCI_INSNREG05_VSTATUS                 USBH_EHCI_INSNREG05_VSTATUS_Msk                            /*!< UTMI VStatus (vendor status) */

#define USBH_EHCI_INSNREG05_VCONTROL_Pos            (8U)
#define USBH_EHCI_INSNREG05_VCONTROL_Msk            (0xFU << USBH_EHCI_INSNREG05_VCONTROL_Pos)                 /*!< 0x00000F00 */
#define USBH_EHCI_INSNREG05_VCONTROL                USBH_EHCI_INSNREG05_VCONTROL_Msk                           /*!< UTMI VCONTROL (vendor control) */

#define USBH_EHCI_INSNREG05_VCONTROL_LDM_Pos        (12U)
#define USBH_EHCI_INSNREG05_VCONTROL_LDM_Msk        (0x1U << USBH_EHCI_INSNREG05_VCONTROL_LDM_Pos)             /*!< 0x00001000 */
#define USBH_EHCI_INSNREG05_VCONTROL_LDM            USBH_EHCI_INSNREG05_VCONTROL_LDM_Msk                       /*!< UTMI VCONTROLLoad (vendor control load) */

#define USBH_EHCI_INSNREG05_VPORT_Pos               (13U)
#define USBH_EHCI_INSNREG05_VPORT_Msk               (0xFU << USBH_EHCI_INSNREG05_VPORT_Pos)                    /*!< 0x0001E000 */
#define USBH_EHCI_INSNREG05_VPORT                   USBH_EHCI_INSNREG05_VPORT_Msk                              /*!< UTMI VPORT */

#define USBH_EHCI_INSNREG05_VBUSY_Pos               (17U)
#define USBH_EHCI_INSNREG05_VBUSY_Msk               (0x1U << USBH_EHCI_INSNREG05_VBUSY_Pos)                    /*!< 0x00020000 */
#define USBH_EHCI_INSNREG05_VBUSY                   USBH_EHCI_INSNREG05_VBUSY_Msk                              /*!< UTMI VBUSY */

/********************  Bit definition for USBH_EHCI_INSNREG06 register  **********************/
#define USBH_EHCI_INSNREG06_SUC_BEATS_Pos           (0U)
#define USBH_EHCI_INSNREG06_SUC_BEATS_Msk           (0xFU << USBH_EHCI_INSNREG06_SUC_BEATS_Pos)                /*!< 0x0000000F */
#define USBH_EHCI_INSNREG06_SUC_BEATS               USBH_EHCI_INSNREG06_SUC_BEATS_Msk                          /*!< Number of successful beats */

#define USBH_EHCI_INSNREG06_EXP_BEATS_Pos           (4U)
#define USBH_EHCI_INSNREG06_EXP_BEATS_Msk           (0x1FU << USBH_EHCI_INSNREG06_EXP_BEATS_Pos)               /*!< 0x000001F0 */
#define USBH_EHCI_INSNREG06_EXP_BEATS               USBH_EHCI_INSNREG06_EXP_BEATS_Msk                          /*!< Number of expected beats */

#define USBH_EHCI_INSNREG06_HBURST_Pos              (9U)
#define USBH_EHCI_INSNREG06_HBURST_Msk              (0x7U << USBH_EHCI_INSNREG06_HBURST_Pos)                   /*!< 0x00000E00 */
#define USBH_EHCI_INSNREG06_HBURST                  USBH_EHCI_INSNREG06_HBURST_Msk                             /*!< HBURST value of the control phase at which the AHB error occurred */

#define USBH_EHCI_INSNREG06_AHB_ECAP_Pos            (31U)
#define USBH_EHCI_INSNREG06_AHB_ECAP_Msk            (0x1U << USBH_EHCI_INSNREG06_AHB_ECAP_Pos)                 /*!< 0x80000000 */
#define USBH_EHCI_INSNREG06_AHB_ECAP                USBH_EHCI_INSNREG06_AHB_ECAP_Msk                           /*!< AHB error captured */

/********************  Bit definition for USBH_EHCI_INSNREG07 register  **********************/
#define USBH_EHCI_INSNREG07_AHB_MST_ERR_Pos          (0U)
#define USBH_EHCI_INSNREG07_AHB_MST_ERR_Msk          (0xFFFFFFFFU << USBH_EHCI_INSNREG07_AHB_MST_ERR_Pos)      /*!< 0xFFFFFFFF */
#define USBH_EHCI_INSNREG07_AHB_MST_ERR              USBH_EHCI_INSNREG07_AHB_MST_ERR_Msk                       /*!< AHB master error address */

/******************************************************************************/
/*                                                                            */
/*                                USB_DWC3 (USB3)                                 */
/*                                                                            */
/******************************************************************************/

