STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp235dxx_cm33.h
/* Bit fields for USB3_GRXFIFOSIZ0 register */
#define USB3_GRXFIFOSIZ0_RXFDEP_N_Pos                            0
#define USB3_GRXFIFOSIZ0_RXFDEP_N_Msk                            (0xffffUL << 0)
#define USB3_GRXFIFOSIZ0_RXFDEP_N                                (0xffffUL << 0)
#define USB3_GRXFIFOSIZ0_RXFSTADDR_N_Pos                         16
#define USB3_GRXFIFOSIZ0_RXFSTADDR_N_Msk                         (0xffffUL << 16)
#define USB3_GRXFIFOSIZ0_RXFSTADDR_N                             (0xffffUL << 16)

/* Bit fields for USB3_GRXFIFOSIZ1 register */
#define USB3_GRXFIFOSIZ1_RXFDEP_N_Pos                            0
#define USB3_GRXFIFOSIZ1_RXFDEP_N_Msk                            (0xffffUL << 0)
#define USB3_GRXFIFOSIZ1_RXFDEP_N                                (0xffffUL << 0)
#define USB3_GRXFIFOSIZ1_RXFSTADDR_N_Pos                         16
#define USB3_GRXFIFOSIZ1_RXFSTADDR_N_Msk                         (0xffffUL << 16)
#define USB3_GRXFIFOSIZ1_RXFSTADDR_N                             (0xffffUL << 16)

/* Bit fields for USB3_GRXFIFOSIZ2 register */
#define USB3_GRXFIFOSIZ2_RXFDEP_N_Pos                            0
#define USB3_GRXFIFOSIZ2_RXFDEP_N_Msk                            (0xffffUL << 0)
#define USB3_GRXFIFOSIZ2_RXFDEP_N                                (0xffffUL << 0)
#define USB3_GRXFIFOSIZ2_RXFSTADDR_N_Pos                         16
#define USB3_GRXFIFOSIZ2_RXFSTADDR_N_Msk                         (0xffffUL << 16)
#define USB3_GRXFIFOSIZ2_RXFSTADDR_N                             (0xffffUL << 16)

/* Bit fields for USB3_GEVNTADRLO register */
#define USB3_GEVNTADRLO_EVNTADRLO_Pos                            0
#define USB3_GEVNTADRLO_EVNTADRLO_Msk                            (0xFFFFFFFFUL << 0)
#define USB3_GEVNTADRLO_EVNTADRLO                                (0xFFFFFFFFUL << 0)

/* Bit fields for USB3_GEVNTADRHI register */
#define USB3_GEVNTADRHI_EVNTADRHI_Pos                            0
#define USB3_GEVNTADRHI_EVNTADRHI_Msk                            (0xFFFFFFFFUL << 0)
#define USB3_GEVNTADRHI_EVNTADRHI                                (0xFFFFFFFFUL << 0)

/* Bit fields for USB3_GEVNTSIZ register */
#define USB3_GEVNTSIZ_EVENTSIZ_Pos                               0
#define USB3_GEVNTSIZ_EVENTSIZ_Msk                               (0xffffUL << 0)
#define USB3_GEVNTSIZ_EVENTSIZ                                   (0xffffUL << 0)
#define USB3_GEVNTSIZ_EVNTINTRPTMASK_Pos                         31
#define USB3_GEVNTSIZ_EVNTINTRPTMASK_Msk                         (0x1UL << 31)
#define USB3_GEVNTSIZ_EVNTINTRPTMASK                             (0x1UL << 31)

/* Bit fields for USB3_GEVNTCOUNT register */
#define USB3_GEVNTCOUNT_EVNTCOUNT_Pos                            0
#define USB3_GEVNTCOUNT_EVNTCOUNT_Msk                            (0xffffUL << 0)
#define USB3_GEVNTCOUNT_EVNTCOUNT                                (0xffffUL << 0)
#define USB3_GEVNTCOUNT_EVNT_HANDLER_BUSY_Pos                    31
#define USB3_GEVNTCOUNT_EVNT_HANDLER_BUSY_Msk                    (0x1UL << 31)
#define USB3_GEVNTCOUNT_EVNT_HANDLER_BUSY                        (0x1UL << 31)

/* Bit fields for USB3_GHWPARAMS8 register */
#define USB3_GHWPARAMS8_ghwparams8_32_0_Pos                      0
#define USB3_GHWPARAMS8_ghwparams8_32_0_Msk                      (0xFFFFFFFFUL << 0)
#define USB3_GHWPARAMS8_ghwparams8_32_0                          (0xFFFFFFFFUL << 0)

/*************  Bit definition for USB3_GUCTL3 register  **************/
#define USB3_GUCTL3_SCH_PING_EARLY_Pos                           16
#define USB3_GUCTL3_SCH_PING_EARLY_Msk                           (0x1UL << 16)
#define USB3_GUCTL3_SCH_PING_EARLY                               (0x1UL << 16)

/* Bit fields for USB3_GTXFIFOPRIDEV register */
#define USB3_GTXFIFOPRIDEV_gtxfifopridev_Pos                     0
#define USB3_GTXFIFOPRIDEV_gtxfifopridev_Msk                     (0xfffUL << 0)
#define USB3_GTXFIFOPRIDEV_gtxfifopridev                         (0xfffUL << 0)

/* Bit fields for USB3_GTXFIFOPRIHST register */
#define USB3_GTXFIFOPRIHST_gtxfifoprihst_Pos                     0
#define USB3_GTXFIFOPRIHST_gtxfifoprihst_Msk                     (0x7UL << 0)
#define USB3_GTXFIFOPRIHST_gtxfifoprihst                         (0x7UL << 0)

/* Bit fields for USB3_GRXFIFOPRIHST register */
#define USB3_GRXFIFOPRIHST_grxfifoprihst_Pos                     0
#define USB3_GRXFIFOPRIHST_grxfifoprihst_Msk                     (0x7UL << 0)
#define USB3_GRXFIFOPRIHST_grxfifoprihst                         (0x7UL << 0)

/* Bit fields for USB3_GDMAHLRATIO register */
#define USB3_GDMAHLRATIO_hsttxfifo_Pos                           0
#define USB3_GDMAHLRATIO_hsttxfifo_Msk                           (0x1fUL << 0)
#define USB3_GDMAHLRATIO_hsttxfifo                               (0x1fUL << 0)
#define USB3_GDMAHLRATIO_hstrxfifo_Pos                           8
#define USB3_GDMAHLRATIO_hstrxfifo_Msk                           (0x1fUL << 8)
#define USB3_GDMAHLRATIO_hstrxfifo                               (0x1fUL << 8)

/* Bit fields for USB3_GFLADJ register */
#define USB3_GFLADJ_GFLADJ_30MHZ_Pos                             0
#define USB3_GFLADJ_GFLADJ_30MHZ_Msk                             (0x3fUL << 0)
#define USB3_GFLADJ_GFLADJ_30MHZ                                 (0x3fUL << 0)
#define USB3_GFLADJ_GFLADJ_30MHZ_SDBND_SEL_Pos                   7
#define USB3_GFLADJ_GFLADJ_30MHZ_SDBND_SEL_Msk                   (0x1UL << 7)
#define USB3_GFLADJ_GFLADJ_30MHZ_SDBND_SEL                       (0x1UL << 7)
#define USB3_GFLADJ_GFLADJ_REFCLK_FLADJ_Pos                      8
#define USB3_GFLADJ_GFLADJ_REFCLK_FLADJ_Msk                      (0x3fffUL << 8)
#define USB3_GFLADJ_GFLADJ_REFCLK_FLADJ                          (0x3fffUL << 8)
#define USB3_GFLADJ_GFLADJ_REFCLK_LPM_SEL_Pos                    23
#define USB3_GFLADJ_GFLADJ_REFCLK_LPM_SEL_Msk                    (0x1UL << 23)
#define USB3_GFLADJ_GFLADJ_REFCLK_LPM_SEL                        (0x1UL << 23)
#define USB3_GFLADJ_GFLADJ_REFCLK_240MHZ_DECR_Pos                24
#define USB3_GFLADJ_GFLADJ_REFCLK_240MHZ_DECR_Msk                (0x7fUL << 24)
#define USB3_GFLADJ_GFLADJ_REFCLK_240MHZ_DECR                    (0x7fUL << 24)
#define USB3_GFLADJ_GFLADJ_REFCLK_240MHZDECR_PLS1_Pos            31
#define USB3_GFLADJ_GFLADJ_REFCLK_240MHZDECR_PLS1_Msk            (0x1UL << 31)
#define USB3_GFLADJ_GFLADJ_REFCLK_240MHZDECR_PLS1                (0x1UL << 31)

/***********  Bit definition for USB3_GUSB2RHBCTL register  ***********/
#define USB3_GUSB2RHBCTL_OVRD_L1TIMEOUT_Pos               0
#define USB3_GUSB2RHBCTL_OVRD_L1TIMEOUT_Msk               (0xFUL << 0)
#define USB3_GUSB2RHBCTL_OVRD_L1TIMEOUT                   (0xFUL << 0)

